Reports/абс_СтратегическиеЦелиПродаж/абс_СтратегическиеЦелиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>абс_СтратегическиеЦелиПродаж</name>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
</mdclass:Report>

AccumulationRegisters/абс_ЦелиПродаж/абс_ЦелиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЦелиПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоТочекПродаж</name>
    <comment>Общее количество точек продаж</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АКБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАртикулов</name>
    <comment>Среднее количество артикулов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦельПоЧисленнойДистрибуции</name>
    <comment>Общее количество точек в которых есть хотя бы одна позиция марки Леовит</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦельПоДистрибуцииФА1</name>
    <comment>Количество точек содержащих фокусный ассортимент 1 уровня</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦельПоДистрибуцииФА2</name>
    <comment>Количество точек содержащих фокусный ассортимент 2 уровня</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦельПоДистрибуцииФА3</name>
    <comment>Количество точек содержащих фокусный ассортимент 3 уровня</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦельПоДистрибуцииФА4</name>
    <comment>Количество точек содержащих фокусный ассортимент 4 уровня</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Город</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Reports/абс_СтратегическиеЦелиПродаж/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Описание исходного текста запроса.
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	абс_ЦелиПродажОбороты.Сценарий КАК Сценарий,
	               |	абс_ЦелиПродажОбороты.Сценарий.Представление,
	               |	абс_ЦелиПродажОбороты.Регион КАК Регион,
	               |	абс_ЦелиПродажОбороты.Регион.Представление,
	               |	абс_ЦелиПродажОбороты.Регистратор,
	               |	абс_ЦелиПродажОбороты.Регистратор.Представление,
	               |	абс_ЦелиПродажОбороты.КоличествоТочекПродажОборот КАК КоличествоТочекПродаж,
	               |	абс_ЦелиПродажОбороты.АКБОборот КАК АКБ,
	               |	абс_ЦелиПродажОбороты.КоличествоАртикуловОборот КАК КоличествоАртикулов,
	               |	абс_ЦелиПродажОбороты.Период КАК ПериодПланирования,
	               |	абс_ЦелиПродажОбороты.Период КАК Период,
	               |	абс_ЦелиПродажОбороты.Территория КАК Территория,
	               |	абс_ЦелиПродажОбороты.Территория.Представление,
	               |	абс_ЦелиПродажОбороты.Город КАК Город,
	               |	абс_ЦелиПродажОбороты.Город.Представление,
	               |	абс_ЦелиПродажОбороты.Канал КАК Канал,
	               |	абс_ЦелиПродажОбороты.Канал.Представление,
	               |	абс_ЦелиПродажОбороты.ЦельПоЧисленнойДистрибуцииОборот КАК ЦельПоЧисленнойДистрибуции,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА1Оборот КАК ЦельПоДистрибуцииФА1,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА2Оборот КАК ЦельПоДистрибуцииФА2,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА3Оборот КАК ЦельПоДистрибуцииФА3,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА4Оборот КАК ЦельПоДистрибуцииФА4
	               |{ВЫБРАТЬ
	               |	Сценарий.*,
	               |	Регион.*,
	               |	Регистратор.*,
	               |	КоличествоТочекПродаж,
	               |	АКБ,
	               |	КоличествоАртикулов,
	               |	ПериодПланирования,
	               |	Территория.*,
	               |	Город.*,
	               |	Канал.*,
	               |	ЦельПоЧисленнойДистрибуции,
	               |	ЦельПоДистрибуцииФА1,
	               |	ЦельПоДистрибуцииФА2,
	               |	ЦельПоДистрибуцииФА3,
	               |	ЦельПоДистрибуцииФА4}
	               |ИЗ
	               |	РегистрНакопления.абс_ЦелиПродаж.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК абс_ЦелиПродажОбороты
	               |{ГДЕ
	               |	абс_ЦелиПродажОбороты.Сценарий.*,
	               |	абс_ЦелиПродажОбороты.Регион.*,
	               |	абс_ЦелиПродажОбороты.Регистратор.*,
	               |	абс_ЦелиПродажОбороты.КоличествоТочекПродажОборот,
	               |	абс_ЦелиПродажОбороты.АКБОборот,
	               |	абс_ЦелиПродажОбороты.КоличествоАртикуловОборот,
	               |	абс_ЦелиПродажОбороты.Период,
	               |	абс_ЦелиПродажОбороты.Территория.*,
	               |	абс_ЦелиПродажОбороты.Город.*,
	               |	абс_ЦелиПродажОбороты.Канал.*,
	               |	абс_ЦелиПродажОбороты.ЦельПоЧисленнойДистрибуцииОборот,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА1Оборот,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА2Оборот,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА3Оборот,
	               |	абс_ЦелиПродажОбороты.ЦельПоДистрибуцииФА4Оборот}
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сценарий,
	               |	Регион,
	               |	Территория,
	               |	Город,
	               |	Канал,
	               |	Период
	               |{УПОРЯДОЧИТЬ ПО
	               |	Сценарий.*,
	               |	Регион.*,
	               |	Территория.*,
	               |	Город.*,
	               |	Канал.*,
	               |	Регистратор.*,
	               |	КоличествоТочекПродаж,
	               |	АКБ,
	               |	КоличествоАртикулов,
	               |	ПериодПланирования,
	               |	ЦельПоЧисленнойДистрибуции,
	               |	ЦельПоДистрибуцииФА1,
	               |	ЦельПоДистрибуцииФА2,
	               |	ЦельПоДистрибуцииФА3,
	               |	ЦельПоДистрибуцииФА4}
	               |ИТОГИ
	               |	СУММА(КоличествоТочекПродаж),
	               |	СУММА(АКБ),
	               |	СУММА(КоличествоАртикулов),
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 1
	               |			ТОГДА ""Январь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 2
	               |			ТОГДА ""Февраль "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 3
	               |			ТОГДА ""Март "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 4
	               |			ТОГДА ""Апрель "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 5
	               |			ТОГДА ""Май "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 6
	               |			ТОГДА ""Июнь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 7
	               |			ТОГДА ""Июль "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 8
	               |			ТОГДА ""Август "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 9
	               |			ТОГДА ""Сентябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 10
	               |			ТОГДА ""Октябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 11
	               |			ТОГДА ""Ноябрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |		КОГДА МЕСЯЦ(ПериодПланирования) = 12
	               |			ТОГДА ""Декабрь "" + ПОДСТРОКА(ПРЕДСТАВЛЕНИЕ(ПериодПланирования), 7, 4) + "" г.""
	               |	КОНЕЦ КАК ПериодПланирования,
	               |	СУММА(ЦельПоЧисленнойДистрибуции),
	               |	СУММА(ЦельПоДистрибуцииФА1),
	               |	СУММА(ЦельПоДистрибуцииФА2),
	               |	СУММА(ЦельПоДистрибуцииФА3),
	               |	СУММА(ЦельПоДистрибуцииФА4)
	               |ПО
	               |	ОБЩИЕ,
	               |	Сценарий,
	               |	Регион,
	               |	Территория,
	               |	Город,
	               |	Канал,
	               |	ПериодПланирования
	               |{ИТОГИ ПО
	               |	Сценарий.*,
	               |	Регион.*,
	               |	Регистратор.*,
	               |	ПериодПланирования,
	               |	Территория.*,
	               |	Город.*,
	               |	Канал.*}";

	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПериодПланирования", "Период планирования");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сценарий", "Сценарий");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Регион", "Бизнес-регион");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Территория", "Территория");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Город", "Город");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Канал", "Канал");
	
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоТочекПродаж", "Общее количество точек продаж");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("АКБ", "Активная клиентская база");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоАртикулов", "Среднее количество артикулов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоЧисленнойДистрибуции", "Цель по численной дистрибуции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА1", "Цель по дистрибуции фокусного ассортимента 1");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА2", "Цель по дистрибуции фокусного ассортимента 2");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА3", "Цель по дистрибуции фокусного ассортимента 3");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА4", "Цель по дистрибуции фокусного ассортимента 4");
	
	// Добавление показателей
	//УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродаж", "Общее количество точек продаж", истина, "ЧЦ=15; ЧДЦ=3");
	//УниверсальныйОтчет.ДобавитьПоказатель("АКБ", "Активная клиентская база", истина, "ЧЦ=15; ЧДЦ=3");
	//УниверсальныйОтчет.ДобавитьПоказатель("КоличествоАртикулов", "Среднее количество артикулов", истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоЧисленнойДистрибуции", "Цель по численной дистрибуции", истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА1", "Цель по дистрибуции фокусного ассортимента 1", истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА2", "Цель по дистрибуции фокусного ассортимента 2", истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА3", "Цель по дистрибуции фокусного ассортимента 3", истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА4", "Цель по дистрибуции фокусного ассортимента 4", истина, "ЧЦ=15; ЧДЦ=3");
	
	УниверсальныйОтчет.мСтруктураПериодов.Вставить("ПериодПланирования", 3);
	
	УниверсальныйОтчет.мСтруктураФорматаПолей.Вставить("Цена", "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Сценарий");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Регион");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ПериодПланирования");
	
	
	// Добавление предопределенных отборов отчета.
	УниверсальныйОтчет.ДобавитьОтбор("Сценарий");
	УниверсальныйОтчет.ДобавитьОтбор("Регион");
	УниверсальныйОтчет.ДобавитьОтбор("Территория");
	УниверсальныйОтчет.ДобавитьОтбор("Город");
	УниверсальныйОтчет.ДобавитьОтбор("Канал");
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодДень", Перечисления.Периодичность.День);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодНеделя", Перечисления.Периодичность.Неделя);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодДекада", Перечисления.Периодичность.Декада);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодМесяц", Перечисления.Периодичность.Месяц);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодКвартал", Перечисления.Периодичность.Квартал);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодПолугодие", Перечисления.Периодичность.Полугодие);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПериодГод", Перечисления.Периодичность.Год);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
